autonomous-ai/autonomous-grid-app/device/esp32-square/sdkconfig.defaults
# Default sdkconfig for the Grid panel (Waveshare ESP32-S3-Touch-LCD-4B).
#
# Applied on first `idf.py build` only — after that sdkconfig is authoritative and this file is ignored.
# The top-level CMakeLists.txt stamps this file's hash so a change here re-seeds sdkconfig instead of
# being silently dropped; read the note there before "simplifying" it away.
#
# Lifted from autonomous-code/apps/esp32-square-s3, which runs on this same board, minus everything the
# network bought: no WiFi, no SoftAP, no HTTP server, no websocket, no TLS, no LWIP tuning. This device
# only ever talks over USB.

# --- Target / flash ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Console: KEEP IT OFF THE NATIVE USB PORT ---
# The single most important line in this file, and the one thing here that was measured on the real board
# rather than inherited.
#
# This board has TWO USB ports: a CH343 UART bridge (1a86:55d3) and the SoC's own USB-Serial-JTAG
# (303a:1001). The protocol runs on the native one. IDF's DEFAULT is to mirror the console onto exactly
# that port as a "secondary" output, and it does it byte for byte: reading both ports for 20 s while
# touching the screen returned 373 bytes, IDENTICAL on both. Every one of those bytes lands in the middle
# of the protocol stream, and the reader on the other end spends its life resyncing.
#
# So the console goes to UART0 (port 1) and NOWHERE else. Note the shape of the fix: the flag to set is
# the "none" arm of the ESP_CONSOLE_SECONDARY choice — writing CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=n
# in a defaults file does NOT deselect a Kconfig choice, it just does nothing at all, which is the sort of
# no-op that looks exactly like a fix.
#
# A residue survives and is by design: the ROM and the second-stage bootloader print to the native port
# before the app owns it, so port 2 carries some text at every boot. The framing walks through it — that
# is what the magic scan and the CRC are for — but a reader that cannot resync will never start.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- PSRAM (ESP32-S3R8 = 8MB octal PSRAM) ---
# PSRAM holds the LVGL object pool and the 450KB panel frame buffer that the LCD peripheral streams out
# continuously. Capacity is not the issue on this board; BANDWIDTH is.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# XIP FROM PSRAM — load-bearing, not an optimisation.
#
# The panel scans its frame buffer out of PSRAM forever; there is no "send a frame" step. IDF's own RGB
# LCD documentation is blunt about the consequence of the alternative: the LCD "cannot function if the
# external memory cache is disabled, such as during OTA or NVS writes to the main flash", and names this
# option as the fix — with XIP the cache stays live across SPI1 flash writes, "making it feasible to
# display an OTA progress bar during your application updates". That is precisely what this device is
# meant to do when grid-app reflashes it over the USB cable.
#
# It SELECTS SPIRAM_FETCH_INSTRUCTIONS + SPIRAM_RODATA, so do not also set those by hand — they become
# forced sub-options and a stale explicit line only confuses the next reader.
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# --- RGB LCD ---
# The driver can detect a DMA under-run (a PSRAM bandwidth spike while the frame buffer is being scanned)
# and re-sync at the next VSYNC. Without this the symptom is PERMANENT — the whole image stays shifted
# sideways until reboot. With it, a bad moment costs one flickered frame.
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y
# CONFIG_LCD_RGB_ISR_IRAM_SAFE is deliberately NOT set. It would force the EOF ISR into IRAM (scarce
# here) so it keeps running while the cache is off — but that ISR reads the frame buffer in PSRAM, which
# is exactly what is unreachable then. XIP above solves the real problem; this would only move it.

# --- CPU / FreeRTOS ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# --- Main task stack ---
# app_main does the hardware bring-up and builds the first screen, both of which are stack-heavy, and it
# then lives forever as the telemetry loop. The reference firmware runs 10240 here for the same reasons
# plus an OTA download; this is its number, not a measured one for this firmware. If it is ever tuned
# down, tune it from the "task=main stack_free_min=" figure in the RAM telemetry line, not from taste.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# --- Log level ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- LVGL v9 ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_PERF_MONITOR=n
# Montserrat is linked for LV_SYMBOL_* glyphs ONLY (bell, gear, wifi, warning, chevrons) — those live in
# a private-use range no other font here covers.
#
# Never set prose in one of these: Montserrat has no Vietnamese, and the accents silently disappear.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_26=y
# LVGL's assert handler is `while(1)` — a failed allocation freezes the LVGL task silently while the rest
# of the firmware keeps running, so the device looks alive and is not. Log at WARN so it says why, and
# keep the object pool big enough that it does not happen (see ui/display.c).
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_ASSERT_MALLOC=n
CONFIG_LV_ASSERT_HANDLER_INCLUDE="stdlib.h"
# KEEP IN STEP WITH display.c's LVGL_PSRAM_POOL_BYTES. LVGL sizes its TLSF index from
# LV_MEM_SIZE + LV_MEM_POOL_EXPAND_SIZE and REJECTS a larger pool at runtime. 64 KiB was measured to
# fragment into a freeze on the reference firmware's round board (2% → 51% within a minute of ordinary
# swiping), which is why it is 512 KiB.
CONFIG_LV_MEM_SIZE_KILOBYTES=8
CONFIG_LV_MEM_POOL_EXPAND_SIZE_KILOBYTES=512

CONFIG_COMPILER_OPTIMIZATION_PERF=y
